app/views/user_courses/new.html.erb

SELECT `courses`.* FROM `courses`
---
		<h2>Select Course</h2>
    	<%= f.select :course_id, Course.all.collect { |course| [ course.name, course.id ] } %>

SELECT `users`.* FROM `users`
---
		<h2>Select User</h2>
    	<%= f.collection_check_boxes :user_id, User.all, :id, :name do |user| %>