app/views/courses/_content_form.html.erb

SELECT `courses`.* FROM `courses`
SELECT `courses`.* FROM `courses` INNER JOIN `user_courses` ON `courses`.`id` = `user_courses`.`course_id` WHERE `user_courses`.`user_id` = 2
---
    <% if current_user.admin == 3 %>
      <%= f.select :course_id, Course.all.collect { |course| [ course.name, course.id ] } %>
    <% else %>
      <%= f.select :course_id, current_user.course.all.collect { |course| [ course.name, course.id ] } %>