app/views/courses/_table_course.html.erb

      <% if current_user.admin != 3 %>
        <% current_user.course.each do |course| %>
---
SELECT `courses`.* FROM `courses` INNER JOIN `user_courses` ON `courses`.`id` = `user_courses`.`course_id` WHERE `user_courses`.`user_id` = 2