app/views/courses/info_course.html.erb

    <% if current_user.admin != 3 %>
      <% current_user.course.each do |course| %>
---
SELECT `courses`.* FROM `courses` INNER JOIN `user_courses` ON `courses`.`id` = `user_courses`.`course_id` WHERE `user_courses`.`user_id` = 2

            <%= link_to 'Show User', show_user_path(course), :method => :get %>
            <% course.user.each do |user| %>
---
SELECT `users`.* FROM `users` INNER JOIN `user_courses_users` ON `users`.`id` = `user_courses_users`.`user_id` INNER JOIN `user_courses` ON `user_courses_users`.`user_course_id` = `user_courses`.`id` WHERE `user_courses`.`course_id` = 1