app/controllers/course_contents_controller.rb

	def index
		@contents = User.includes(:user_courses).includes(:courses).includes(:course_contents)
---
SELECT `course_contents`.* FROM `course_contents` WHERE `course_contents`.`course_id` IN (1, 2)
SELECT `courses`.* FROM `courses` INNER JOIN `user_courses` ON `courses`.`id` = `user_courses`.`course_id` WHERE `user_courses`.`user_id` = 3
SELECT `users`.* FROM `users`