app/controllers/courses_controller.rb

SELECT `user_courses`.* FROM `user_courses` WHERE `user_courses`.`course_id` = 1
SELECT `courses`.* FROM `courses` INNER JOIN `user_courses` ON `courses`.`id` = `user_courses`.`course_id` WHERE `user_courses`.`user_id` = 2
SELECT `users`.* FROM `users`
---
	def index
		if current_user.admin == 3
			@courses = Course.all
		else
			@courses = User.includes(:user_courses).includes(:course)

SELECT `courses`.* FROM `courses`
SELECT `courses`.* FROM `courses` INNER JOIN `user_courses` ON `courses`.`id` = `user_courses`.`course_id` WHERE `user_courses`.`user_id` = 2
SELECT `users`.* FROM `users` INNER JOIN `user_courses_users` ON `users`.`id` = `user_courses_users`.`user_id` INNER JOIN `user_courses` ON `user_courses_users`.`user_course_id` = `user_courses`.`id` WHERE `user_courses`.`course_id` = 1
---
	def info_course
		if current_user.admin == 3
			@courses = Course.all
		else
			@courses = User.includes(:user_courses).includes(:course)

INSERT INTO `courses` (`name`, `info`, `description`, `subject`, `study`, `created_at`, `updated_at`) VALUES ('Health and Education', 'Talk about Human Life', 'How did we survive?', 'Health and Life', 'Online Study', '2017-04-06 07:22:03', '2017-04-06 07:22:03')
---
	def create
		@course = Course.new(course_params)
        if @course.save

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` IS NULL LIMIT 1
---
	def edit
		@course = Course.find(params[:id])

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
UPDATE `courses` SET `subject` = 'Health and Life', `updated_at` = '2017-04-08 06:37:45' WHERE `courses`.`id` = 3
---
	def update
		@course = Course.find(params[:id])

        if @course.update(course_params)

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
DELETE FROM `courses` WHERE `courses`.`id` = 2
---
	def destroy
		@course = Course.find(params[:id])
        @course.destroy

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
	def content
		@course = Course.find(params[:id])

INSERT INTO `course_contents` (`name`, `description`, `course_id`, `created_at`, `updated_at`) VALUES ('C++ Beginning', 'Start with C++', 1, '2017-04-09 04:08:02', '2017-04-09 04:08:02')
---
	def create_content
		@content = CourseContent.new(content_params)
        if @content.save

SELECT  `course_contents`.* FROM `course_contents` WHERE `course_contents`.`course_id` = 1 AND `course_contents`.`id` = 1 LIMIT 1
---
	def edit_content
		@content = CourseContent.find(params[:id])

SELECT  `course_contents`.* FROM `course_contents` WHERE `course_contents`.`id` = 10 LIMIT 1
UPDATE `course_contents` SET `description` = 'Understanding code from beginning', `updated_at` = '2017-04-09 05:56:50' WHERE `course_contents`.`id` = 10
---
	def update_content
		@content = CourseContent.find(params[:id])

        if @content.update(content_params)

SELECT  `course_contents`.* FROM `course_contents` WHERE `course_contents`.`course_id` = 3 AND `course_contents`.`id` = 3 LIMIT 1
DELETE FROM `course_contents` WHERE `course_contents`.`id` = 3
---
	def destroy_content
		@content = CourseContent.find(params[:id])

		@content.destroy