app/controllers/course_contents_controller.rb

    def content
        #Add exception for searching details and security for contents
        begin
            @course = Course.find(params[:id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1