app/controllers/users_controller.rb

	def show
        @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

	def create
		@user = User.new(user_params)
        if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `admin`) VALUES ('Blake', 'blake@example.com', '$2a$10$O8cGBK.NxgR8pZ1jEMDuNul.femhZdI.KW3vdDX4l/oz6hLK4wNQy', 1)

    def update
        @user = User.find(params[:id])

        if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `name` = 'Van Do', `password_digest` = '$2a$10$5Ln2p/oVpS3swFSxbx7ZfuTyH18.LMR/RzUVo1.GN1E8ct32FXCoW' WHERE `users`.`id` = 1

    def destroy
        @user = User.find(params[:id])
        if @user.id == current_user.id
             redirect_to users_index_path, alert: "Cannot delete yourself."
        else
            @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 5

        def set_user
            if @user
    		  @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1