app/controllers/user_courses_controller.rb

	def new
		#Set count to 0
		@count = 0
		@user_course = UserCourse.new

		#Collect all users those who are student or lecturer
		@user = []

		User.all.each do |user|
---
SELECT `users`.* FROM `users`

	def create
		#If user has not select course or user redirect to new user course and display alert
		if params[:user_course][:course_id].size > 1
			if params[:user_course][:user_id].size > 1
				#Ignore nil in both params, create them into database
				params[:user_course][:course_id].reject(&:blank?).each do |course|
					params[:user_course][:user_id].reject(&:blank?).each do |user|
						#Check to see if the relationship has already exists, otherwise create new relationship.
						if UserCourse.exists?(user_id: user, course_id: course)
							#If exists, alert and return to new connect path
							flash[:alert] = "Invalid! One or more relationships have already exist. Please check associations."
							redirect_to new_connect_path and return
						else
							@user_course = UserCourse.create(:user_id => user, :course_id => course)
---
INSERT INTO `user_courses` (`course_id`) VALUES (3)